<template>
  <el-container style="margin-top: 8px;padding:0 25px 0 25px;height: 100%" class="common-layout">
    <el-header style="display: flex;flex-direction: column">
      <div style="display:flex;justify-content: center;margin:0 auto;">
        <h2>入住资格</h2>
      </div>
      <div style="display: flex;margin-top: 20px">
        <div>
          <h3><i class="bi bi-mortarboard-fill" style="color: red"/> 行业名师</h3>
          <p style="font-size: 13px;color: gray">丰富的培训授课经验拥有自己擅长的领域</p>
        </div>
        <el-divider style="height: auto" direction="vertical"/>
        <div>
          <h3><i class="bi bi-book-half" style="color: red"/> 知名学者</h3>
          <p style="font-size: 13px;color: gray">权威的教育背景，在培训行业公认的，具有影响力的专家学者</p>
        </div>
        <el-divider style="height: auto" direction="vertical"/>
        <div>
          <h3><i class="bi bi-person-hearts" style="color: red"/> 知识网红</h3>
          <p style="font-size: 13px;color: gray">自媒体专家，强大的粉丝群体，对某一行业领域有深度思考和洞见</p>
        </div>
        <el-divider style="height: auto" direction="vertical"/>
        <div>
          <h3><i class="bi bi-people-fill" style="color: red"/> 实战专家</h3>
          <p style="font-size: 13px;color: gray">国内知名企业丰富的实战经验</p>
        </div>
      </div>
    </el-header>
    <el-main style="margin-top: 75px;padding: 0 !important">
        <div style="margin:20px">
          <h3 style="display: flex;justify-content: center">申请讲师协议:</h3>
          <span style="font-size: 8px">
              <h4>甲方：在线教育平台（简称“甲方”）</h4>
              <h4>乙方：提交有效申请并经在线教育平台审核通过后，有权在在线教育平台制作，并在在线教育平台发布付费作品的自然人、法人、其他机构组织。</h4>
              <h4>一、合作协议总则</h4>
              1、 本协议双方为甲方和乙方（以下简称“讲师”或“您”）。<br/>
              2、 乙方在注册前请仔细阅读本协议的条款，并按照页面上的提示完成全部注册程序。<br/>
              3、 乙方在进行注册过程中点击“同意”按钮，即表示您已充分知悉和完全接受本协议项下全部条款，进而与甲方达成本协议。<br/>
              4、 甲方有权不时对本协议项下各类业务规则作出修改或补充，并通过甲方网站公布。您若继续使用即视为您接受修订后的本协议条款。否则,您有权在确保用户权益的情况下终止与甲方的合作。<br/>
              <h4>二、合作内容</h4>
              1、乙方作为甲方旗下: 在线教育平台 的签约讲师，基于甲方 的在线教育平台，为甲方的用户提供远程培训课程及答疑服务。乙方主要工作包括录制课程和定期在线答疑。<br/>
              2、甲方提供对乙方的课程信息（讲师）展示和推广服务，提供对课程播放的技术维护、服务器宽带、客服销售支持工作。<br/>
              <h4>三、分成比例与结算方式</h4>
              1、乙方享有对提供的课程的定价权，甲方可提出定价参考建议。<br/>
              2、甲乙双方按约定比例分成，按乙方在甲方平台的课程交易额，乙方收取销售额的比例为 60% ，甲方获取销售额的比例为 40% ；<br/>
              3、乙方提供的课程在甲方平台上销售收入和销售分成以甲方系统中实际记录的数据为准,若有异议的双方可协商处理,并于协商之日起7个工作日内予以确认。双方无法协商一致的，任何一方可按本协议争议解决条款维护权益。<br/>
              4、乙方分成收益的结算周期为1个月, 甲方于每个月的前10个工作日（法定节假日顺延）汇总统计乙方的应得收益，经乙方确认无误之日起（以电子邮件或微信的形式确认），甲方在3个工作日内将款项支付至乙方指定银行账户。<br/>
              5、乙方的银行卡信息若变更需及时通知甲方,否则造成的损失由乙方负责。<br/>
              <h4>四、课程内容规定</h4>
              1、乙方提供的录制课程不得含有下列内容：<br/>
              （1） 违反宪法确定的基本原则的。<br/>
              （2） 危害国家的统一、主权和领土完整的。<br/>
              （3） 泄漏国家秘密、危害国家安全或者损害国家的荣誉和利益的。<br/>
              （4） 煽动民族仇恨、分裂和歧视，侵害少数民族风俗习惯，破坏民族团结的。<br/>
              （5） 宣扬邪教、迷信的，扰乱社会秩序，破坏社会稳定的。<br/>
              （6） 宣扬淫秽、赌博或者渲染暴力、教唆犯罪的，危害社会公德和民族优秀文化传统的。<br/>
              （7） 侮辱或者诽谤他人，侵害他人合法权益的。<br/>
              （8） 有法律、行政法规和国家规定禁止的其他内容的。<br/>
              2、如因乙方课程内容违法违规造成的一切损失和责任，由乙方自行独立承担。如甲方发现乙方课程存在前述不合法不合规的情况，有权告知乙方并建议调整及整改；乙方应积极配合，主动整改。自收到甲方建议之日起7个工作日内未整改完毕的，甲方有权单方解除本合同。<br/>
              <h4>五、课程交付规则</h4>
              1、乙方提交课程大纲经甲方审核通过之日起（以电子邮件或微信的形式确认），乙方应在1个月内提交第一次课时内容（首次提交的课时内容不得少于全部课时内容的50%），并承诺保证以后每周至少提交3个课时以上的内容，全部课时必须在3个月以内完成提交。<br/>
              2、如乙方由于不可抗力导致不能按时提交/更新课程时，须在出现该原因之日起5日内通知甲方，双方另行约定课程的更新/交付日期。<br/>
              3、如果因乙方个人原因导致无法按时完成全部课程时，乙方需提前7个工作日与甲方进行协商沟通, 双方另行约定课程的更新/交付日期。<br/>
              4、如果在双方另行约定更新/交付日期到期时，乙方仍不能更新/交付课件，甲方有权选择下线该课程，单方解除合作关系而不承担任何违约责任；乙方同意对已上线的课程收入所得进行冻结，用以垫付用户/学员退款（退款金额全部由乙方承担）；如果乙方课程收入所得无法满足向用户/学员退款的金额，不足部分由乙方承担差额补足责任，并对由此给甲方造成的损失承担法律责任。<br/>
              <h4>六、课程发布规则</h4>
              1、乙方提供的课程中，必须有1个课时（包含1个课时）以上的免费课时。<br/>
              2、乙方提交课程之日起7个工作日内，甲方应完成课程审核，并发布上线，如审核未通过将会在审核结束后3个工作日内以电子邮件方式通知乙方。<br/>
              3、如因任何一方出现不可抗力而需要推迟课程发布日期时，存在不可抗力的一方应向另一方及时说明，双方另行协商确定课程发布日期。<br/>
              4、如甲方由于不可抗力停止该课程的合作，甲方应按照本合作协议项下的分成比例条款向乙方支付该课程剩余销售所得。<br/>
              <h4>七、播放权与版权规则</h4>
              1、乙方提供给甲方在线教育平台所发布的课程以及课件（包括但不限于文档），在本协议有效期内，甲方拥有课程及课件的播放权、使用权。本协议有效期届满（或经双方协商一致同意提前终止合作协议后），为保证已付费用户利益，甲方仍保留该课程对已付费用户的播放权，但不会再销售该课程。<br/>
              2、如出现因乙方提供的课程涉嫌违反相关法律法规规定，有可能导致甲方承担法律责任、经济或名誉损失的，甲方有权决定停播此课程。<br/>
              3、如发现乙方提供的课程在其它网站（包含乙方自己的网站）销售价格低于在甲方网站上销售的价格，甲方有权决定停播此课程。课程停播后，如果出现需要向付费用户退款的情况，乙方同意将乙方课程收入所得用以垫付用户/学员退款（退款金额由乙方承担）；如果乙方课程收入所得无法满足向用户/学员退款的金额，不足部分由乙方承担差额补足责任，并对由此给甲方造成的损失承担法律责任。<br/>
              4、除本条第1点约定的播放权和使用权外，本课程的版权归乙方所有。<br/>
              5、乙方承诺向甲方提供的课程不存在与第三方的任何版权纠纷或潜在争议。否则，由此带来的一切法律后果由乙方自行独立承担。<br/>
              <h4>八、服务规则</h4>
              1、乙方按照提交的课程大纲录制作品，并在甲乙双方商定时间内交付/更新。<br/>
              2、课程上线后，乙方（讲师）应在48小时内线上回复付费用户与该课程有关的疑问。<br/>
              3、本协议有效期届满（或经双方协商一致同意提前终止合作后），乙方仍需回复付费用户与该课程有关的疑问。<br/>
              <h4>九、保密规则</h4>
              1、甲乙双方应对因履行本协议而取得的对方的各种形式的技术或商业信息保密（包括本协议内容本身），法律法规另有规定的除外；未经一方事先书面允许，另一方不得将双方合作信息，如价格，销售分成比例等透露给第三方。<br/>
              <h4>十、其他约定</h4>
              1、本协议项下任何争议，双方应友好协商解决；协商不成的，任何一方均可向甲方所在地人民法院提起诉讼。<br/>
              2、课程的具体录制内容等其他条款，双方在《课程制作规范》进行约定。《课程制作规范》和本协议具有同等的法律效力。<br/>
              3、自乙方点击同意接受本协议全部条款之时生效。<br/>
            </span>
          <el-checkbox id="checkbox" size="large" style="color: red">我已阅读并同意此协议</el-checkbox>
        </div>
    </el-main>
    <el-footer style="display: flex;justify-content: center;align-items: center">
      <el-button @click="nextStep()" type="primary">下一步</el-button>
    </el-footer>
  </el-container>
</template>
<script setup>
import $ from "jquery";
import {ElMessage} from "element-plus";
import router from "../../../router"
function nextStep() {
  if ($('#checkbox').is(':checked')) {
    router.push({
      path:"/apply/tdetail",
      //params:{}传参
    })
  } else {
    ElMessage({message: "请阅读并勾选同义词选项", type: 'warning'});
  }
}
</script>